---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySetIterator.#ctor
source: html/080e616b-7b8b-6c5d-3ea0-b63143875836.htm
---
# Autodesk.Revit.DB.PlanTopologySetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public PlanTopologySetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.